tuning_wdr/log/benchmark_log/1699540461.log
[2023-11-09 22:34:56,357:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            448
        write:                           128
        other:                           64
        total:                           640
    transactions:                        32     (1.21 per sec.)
    queries:                             640    (24.16 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          25.6177s
    total number of events:              32

Latency (ms):
         min:                                23631.16
         avg:                                24633.18
         max:                                25615.34
         95th percentile:                    25448.93
         sum:                               788261.70

Threads fairness:
    events (avg/stddev):           1.0000/0.00
    execution time (avg/stddev):   24.6332/0.53


[2023-11-09 22:35:19,026:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            462
        write:                           132
        other:                           66
        total:                           660
    transactions:                        33     (2.25 per sec.)
    queries:                             660    (44.96 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          14.6767s
    total number of events:              33

Latency (ms):
         min:                                 3427.92
         avg:                                 9775.72
         max:                                14673.95
         95th percentile:                    13308.98
         sum:                               322598.60

Threads fairness:
    events (avg/stddev):           1.0312/0.17
    execution time (avg/stddev):   10.0812/2.31