tuning_wdr/log/benchmark_log/1699544553.log
[2023-11-09 23:43:02,295:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            448
        write:                           128
        other:                           64
        total:                           640
    transactions:                        32     (2.05 per sec.)
    queries:                             640    (41.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          15.6060s
    total number of events:              32

Latency (ms):
         min:                                10839.37
         avg:                                11863.14
         max:                                15603.03
         95th percentile:                    13550.80
         sum:                               379620.52

Threads fairness:
    events (avg/stddev):           1.0000/0.00
    execution time (avg/stddev):   11.8631/1.00


[2023-11-09 23:43:46,409:stress_testing_tool.py#L123:INFO]: sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            448
        write:                           128
        other:                           64
        total:                           640
    transactions:                        32     (1.94 per sec.)
    queries:                             640    (38.84 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          16.4737s
    total number of events:              32

Latency (ms):
         min:                                 5929.93
         avg:                                11609.02
         max:                                16470.91
         95th percentile:                    16224.31
         sum:                               371488.73

Threads fairness:
    events (avg/stddev):           1.0000/0.00
    execution time (avg/stddev):   11.6090/2.76